export const ru = {
  language: 'Русский',
  header: {
    setting: {
      title: 'Настройки',
      language: 'Язык',
    },
    sort: {
      title: 'Сортировать',
      name: 'Имя',
      date: 'Дата изменения',
      type: 'Тип',
      asc: 'По возрастанию',
      des: 'По убыванию',
      group: 'Группировать по типу',
      by: "By",
      on:"On"
    },
    view: {
      title: 'Вид',
      list: 'Список',
      tiles: 'Плитка',
      navigation: 'Панель навигации',
      preview: 'Панель предпросмотра',
      extension: 'Расширение',
      as: "As",
      display: "Display"
    },
    select: {
      title: 'Выбрать',
      all: 'Выбрать все',
      none: 'Отменить выбор',
      invert: 'Инвертировать выбор',
      clickSelect: 'Нажмите, чтобы выбрать',
      clickBrowse: 'Нажмите, чтобы открыть',
      outsideDeselect: 'Нажмите снаружи, чтобы отменить выбор',
    },
    about: {
      title: 'О программе',
      shortcuts: 'Горячие клавиши',
      documentation: 'Документация',
      premium: 'Премиум',
      update: 'Проверить обновления',
    },
    tasks: {
      title: 'Running tasks',
    },
  },
  search: {
    title: 'Поиск',
    placeholder: 'Ищу...',
  },
  controls: {
    download: 'Скачать',
    rename: 'Переименовать',
    copy: 'Копировать',
    move: 'Переместить',
    delete: 'Удалить',
    upload: 'Загрузить',
    create: 'Создайте новый ...',
    newFolder: '📁 Каталог',
    newFile: '📄 Текстовый файл',
    compress: 'Сжать',
  },
  files: {
    icons: {
      file: '📄',
      folder: '📁',
      home: "<i class='fa fa-solid fa-home'></i>",
    },
    empty: 'Этот каталог пуст',
  },
  toast: {
    title: 'Что-то пошло не так',
    error: {
      upload: 'Некоторые файлы не были загружены.',
      fileNameEmpty: 'Имя файла не может быть пустым',
      folderNameEmpty: 'Имя папки не может быть пустым',
    },
  },
  upload: {
    uploading: 'Загрузка',
    completed: 'Upload completed',
    completedMessage: 'Загружено {0} файлов!',
  },
  modals: {
    close: 'Закрыть',
    delete: {
      title: 'Удалить файлы',
      description: 'Эти файлы будут удалены и не могут быть восстановлены, вы действительно ДЕЙСТВИТЕЛЬНО уверены?',
      submit: 'Удалить',
    },
    newFile: {
      title: 'Создать новый файл',
      name: 'Имя файла',
      namePlaceholder: 'Имя файла...',
      content: 'Контент',
      contentPlaceholder: 'Какой-то текст...',
      submit: 'Создать',
    },
    newFolder: {
      title: 'Создать новый каталог',
      namePlaceholder: 'Имя каталога или путь...',
      submit: 'Создать',
    },
    rename: {
      title: 'Переименовать файлы',
      submit: 'Переименовать',
    },
    selectDestination: {
      title: 'Выбрать назначение',
      copy: 'Копировать',
      move: 'Переместить',
    },
    premium: {
      title: 'Mountain премиум 👑',
      description: '',
      submit: 'Купить Премиум',
    },
    shortcuts: {
      operations: 'Операции',
    },
    compress: {
      fileName: 'Имя файла',
      format: 'Формат',
      submit: 'Сжать',
    },
  },
  tasks: {
    none: 'All task are completed!',
    rename: 'Rename:',
    copy: 'Copy from:',
    move: 'Move from:',
    delete: 'Delete everything in:',
    compress: 'Compress:',
  },
}
